Repository: Nekk/i18nSample
Catalog: src/locale/messages.*.xlf
Languages: fr, th

# introductionHeader
source: Hello i18n!
fr: Bonjour i18n !

source: I don't output any element
fr: Je n'affiche aucun élément
th: ไม่มีอะไรออกมา

source: Angular logo
fr: Logo d'Angular
th: แองกูลาาา โลโก้วว

source: Updated {minutes, plural, =0 {...} =1 {...} other {...}}
fr: Mis à jour {minutes, plural, =0 {...} =1 {...} other {...}}
th: อัพเดทแล้ว {minutes, plural, =0 {...} =1 {...} other {...}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago} }
fr: {VAR_PLURAL, plural, =0 {à l'instant} =1 {il y a une minute} other {il y a {{minutes}} minutes} }
th: {VAR_PLURAL, plural, =0 {ตอนนี้} =1 {นาทีที่แล้ว} other {{{minutes}} นาทีsที่แล้ว} }

source: The author is {gender, select, male {...} female {...} other {...}}
fr: L'auteur est {gender, select, male {...} female {...} other {...}}
th: คนเขียนเป็น{gender, select, male {...} female {...} other {...}}

source: {VAR_SELECT, select, male {male} female {female} other {other} }
fr: {VAR_SELECT, select, male {un homme} female {une femme} other {autre} }
th: {VAR_SELECT, select, male {ชาย} female {หญิง} other {อื่นๆ} }

source: Updated: {minutes, plural, =0 {...} =1 {...} other {...}}
fr: Mis à jour: {minutes, plural, =0 {...} =1 {...} other {...}}
th: อัพเดทแล้ว: {minutes, plural, =0 {...} =1 {...} other {...}}

source: {VAR_PLURAL, plural, =0 {just now} =1 {one minute ago} other {{{minutes}} minutes ago by {VAR_SELECT, select, male {male} female {female} other {other} }} }
fr: {VAR_PLURAL, plural, =0 {à l'instant} =1 {il y a une minute} other {il y a {{minutes}} minutes par {VAR_SELECT, select, male {un homme} female {une femme} other {autre} }} }
th: {VAR_PLURAL, plural, =0 {ตอนนี้} =1 {นาทีที่แล้ว} other {{{minutes}} นาทีs ที่แล้วโดย {VAR_SELECT, select, male {ชาย} female {หญิง} other {อื่นๆ} }} }

# testId
source: Test
fr: examen
th: เทสสสส

source: English
fr: Anglais
th: อังกฤษ

source: Thai
fr: Thaïlandais
th: ไทย

source: French
fr: Français
th: ฝรั่งเศส

# introductionHeader
source: Hello i18n!
th: สวัสดี i18n
